app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "kenting"], ["password_digest", "$2a$12$.hoQ9Cnxr5dbiq0hShea4uHglbHfowwmrnfnQ4voOR4QzsWTNNWIO"], ["session_token", "o45OmaHL12RjL_iq36rEwQ"]]
---
  def create
    user = User.new(user_params)

    if user.save